#include <iostream>
#include <vector>
#include <iomanip>

using namespace std;

int main() {
    setlocale(LC_ALL, "Russian");

    double S, C_L;

    cout << "Задача 6. Расчет подъемной силы на траектории\n";
    cout << "Введите площадь крыла S(м^2) : "; 
    cin >> S;
    cout << "Введите коэффициент подъемной силы C_L : ";
    cin >> C_L;

    // Массивы скоростей и плотностей воздуха на разных высотах
    vector<double> V = { 50.0, 75.0, 100.0, 125.0, 150.0 };
    vector<double> rho = { 1.225, 1.112, 1.007, 0.909, 0.819 };

    cout << "\n + ------ + ------------ + ------------ + -------------------- + \n";
    cout << " | Шаг | Скорость | Плотность | Подъемная сила(Н) | \n";
    cout << " + ------ + ------------ + ------------ + -------------------- + \n";

    for (size_t i = 0; i < V.size(); ++i) {
        double L = 0.5 * rho[i] * V[i] * V[i] * S * C_L;
        cout << " | " << setw(4) << i + 1 << " | " << setw(10) << V[i] << " | " << setw(10) << rho[i] << " | " << setw(18) << fixed << setprecision(2) << L << " | \n";
    }
    cout << " + ------ + ------------ + ------------ + -------------------- + \n";

   return 0;
}
