#include <iostream>

using namespace std;

const double G = 9.81; // Ускорение свободного падения (м/с²)

int main() {
    setlocale(LC_ALL, "Russian");

    double m, L, D, T;

    cout << "Задача 3. Определение ускорения ЛА\n";
    cout << "Введите массу m(кг) : "; 
    cin >> m;
    cout << "Введите подъемную силу L(Н) : "; 
    cin >> L;
    cout << "Введите сопротивление D(Н) : "; 
    cin >> D;
    cout << "Введите тягу двигателя T(Н) : "; 
    cin >> T;

    // Формулы ускорений
    double a = (T - D) / m;       // Продольное ускорение по направлению движения
    double ay = (L - m * G) / m;  // Вертикальное ускорение

    cout << "\n-- - Результаты расчетов-- - \n";
    cout << "Ускорение по направлению движения a = " << a << " м / с^2(определяется разностью тяги T и сопротивления D)\n";
    cout << "Вертикальное ускорение ay = " << ay << " м / с^2(определяется разностью подъемной силы L и силы тяжести m * g)\n";

    return 0;
}

